
#Область СлужебныеПроцедурыИФункции_УправлениеДоступом
///////////ПолучитьПоляДоступа////////////////////////////////////////
Функция ПолучитьПоляДоступа() Экспорт
	
	Возврат 
		"Ссылка";
	
КонецФункции //ПолучитьПоляДоступа  

///////////СформироватьДанныеПоЗаявкам////////////////////////////////////////
Функция СформироватьДанныеПоЗаявкам() Экспорт 
	
	ТекущийПользователь = ПользователиКлиентСервер.ТекущийПользователь();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СУММА(ВЫБОР
	|			КОГДА ТБС_ЗаявкиIT.Статус = ЗНАЧЕНИЕ(Перечисление.ТБС_СтатусыЗаявкиIT.Новая)
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Нераспределено,
	|	СУММА(1) КАК Всего,
	|	СУММА(ВЫБОР
	|			КОГДА ТБС_ЗаявкиIT.Исполнитель = &Исполнитель
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК МоиЗаявки,
	|	СУММА(ВЫБОР
	|			КОГДА ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0) <> ТБС_ЗаявкиIT.ВыполнитьДо
	|					И ТБС_ЗаявкиIT.ВыполнитьДо < &ТекущаяДата
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Просрочено,
	|	СУММА(ВЫБОР
	|			КОГДА ТБС_ЗаявкиIT.Исполнитель <> ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Неисполнено
	|ИЗ
	|	Документ.ТБС_ЗаявкиIT КАК ТБС_ЗаявкиIT
	|ГДЕ
	|	ТБС_ЗаявкиIT.ПроцентВыполнения < 100";
	
	Запрос.УстановитьПараметр("Исполнитель",ТекущийПользователь);
	Запрос.УстановитьПараметр("ТекущаяДата",ТекущаяДата());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Структура = Новый Структура;
	Структура.Вставить("Нераспределено");
	Структура.Вставить("Всего");
	Структура.Вставить("МоиЗаявки");
	Структура.Вставить("Просрочено");
	Структура.Вставить("Неисполнено");
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Структура,Выборка);
	КонецЦикла;    
	
	Возврат Структура;
	
КонецФункции //СформироватьДанныеПоЗаявкам

#КонецОбласти

