
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ОтключитьОтбор(Команда)
	
	ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбораДинамическогоСписка(Список, "Наименование");
	ЭтотОбъект.Элементы.Список.Отображение = ОтображениеТаблицы.ИерархическийСписок;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если мСписок Тогда
		Элементы.Список.Отображение = ОтображениеТаблицы.Список;
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Отбор.Свойство("Наименование") Тогда
		мСписок = Истина;
	КонецЕсли;
	
КонецПроцедуры            

#КонецОбласти
