
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.Ссылка.Пустая() Тогда
		
		УстановитьПоУмолчаниюПоля();
		
		ОбновитьДанныеПоСотруднику();
		
	КонецЕсли;

	// Файлы
	ЗаполнитьСписокФайлов(Истина);
	
	ЭтотОбъект.СтатусВзаимодействие = 1;
 
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЭтаФорма.ТекущийЭлемент = Элементы.Система;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПользовательПриИзменении(Элемент)
	
	ОбновитьДанныеПоСотруднику();
	
КонецПроцедуры

/////////////УстановитьПоУмолчаниюПоля//////////////////////////////////////////
Процедура УстановитьПоУмолчаниюПоля()
	
	ТекущийПользователь = ПользователиКлиентСервер.ТекущийПользователь();
	
	Если Не ЗначениеЗаполнено(Объект.Пользователь) Тогда 
		Объект.Пользователь = ТекущийПользователь;
	КонецЕсли;	
	Объект.Ответственный = ТекущийПользователь;
	
	Объект.Важность = Перечисления.ТБС_Важность.Низкая;
    Объект.Статус   = Перечисления.ТБС_СтатусыЗаявкиIT.Новая;
	
	Если НЕ РольДоступна("ТБС_ЗаявкиIT") Тогда
		Элементы.ГруппаИсполнители.ТолькоПросмотр = Истина;
		Элементы.Статус.ТолькоПросмотр            = Истина;
	КонецЕсли; 
	
	
КонецПроцедуры //УстановитьПоУмолчаниюПоля

/////////////ОбновитьДанныеПоСотруднику/////////////////////////////////////////
&НаСервере
Процедура ОбновитьДанныеПоСотруднику()
	
	Объект.Подразделение = РаботаСПользователями.ПолучитьПодразделение(Объект.Пользователь);
	Объект.Дивизион      = Объект.Подразделение.ТБС_Дивизион;   
	
	Документ = РеквизитФормыВЗначение("Объект");
    Объект.Телефон = Документ.КонтактнаяИнформацияПользователя(Объект.Пользователь);
	
КонецПроцедуры //ОбновитьДанныеПоСотруднику

&НаКлиенте
Процедура ПредварительныйСрокВыполненияПриИзменении(Элемент)
	
	Отказ = Ложь;
	Если НачалоДня(Объект.ВыполнитьДо) <= НачалоДня(Объект.Дата) Тогда
		 Объект.ВыполнитьДо = Дата("00010101");
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Неправильно введена дата'"),
		Формат(Объект.ВыполнитьДо, "ДЛФ=D"));
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
		ТекстСообщения,
		ЭтотОбъект,
		"ВыполнитьДо",, 
		Отказ);

	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияВзаимодействиеНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Объект.Ссылка.Пустая() Тогда 
		ПоказатьПредупреждение(, НСтр("ru = 'Для перехода по ссылке документ необходимо записать.'"));
		Возврат;
	КонецЕсли;	
	
	ОткрытьФорму("ОбщаяФорма.ПроцессыИЗадачи",
		Новый Структура("Предмет", Объект.Ссылка), ЭтаФорма, ЭтаФорма.КлючУникальности, ЭтаФорма.Окно);
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппаСтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	 Если ТекущаяСтраница.Имя = "ГруппаБизнесПроцессы" Тогда
	 	  ДекорацияВзаимодействиеНажатие(Элемент, Ложь)
	 КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ИсполнителиЦенаПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.Исполнители.ТекущиеДанные;
	ТекущаяСтрока.Стоимость = ТекущаяСтрока.Цена * ТекущаяСтрока.ТрудоемкостьРабЧасов; 
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Заполняет список файлов в карточке документа
//
//	Параметры
//		ЗаполнитьПризнакОригинал - Булево - если Истина, то будет заполнен признак оригинала
//
&НаСервере
Процедура ЗаполнитьСписокФайлов(ЗаполнитьПризнакОригинал = Ложь)
	
	Делопроизводство.ЗаполнитьСписокФайловДокумента(ЭтаФорма);
	
КонецПроцедуры	

#Область РаботаСФайлами
////////////////////////////////////////////////////////////////////////////////
// Команды работы с таблицей Файлы
////////////////////////////////////////////////////////////////////////////////
// Работа с файлами
&НаКлиенте
Процедура ДобавитьФайл(Команда)
	
		
	Если Объект.Ссылка.Пустая() Тогда 
		Если Не Записать() Тогда 
			Возврат;
		КонецЕсли;
		
		ПоказатьОповещениеПользователя(
		НСтр("ru = 'Создание:'"), 
		ПолучитьНавигационнуюСсылку(Объект.Ссылка),
		Строка(Объект.Ссылка),
		БиблиотекаКартинок.Информация32);
	КонецЕсли;
	
	
	ПараметрыДобавления = Новый Структура;
	
	ТекущаяТаблица = Элементы.Файлы;
	
	ФайлыПередНачаломДобавленияКлиент(ТекущаяТаблица, Истина, Ложь, Неопределено, Неопределено, ПараметрыДобавления);
	
	// Файлы
	ЗаполнитьСписокФайлов(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ФайлыПередНачаломДобавленияКлиент(Элемент, Отказ, Копирование, Родитель, Группа, ПараметрыДобавления)
	Попытка
		РежимСоздания = 2;
		РаботаСФайламиКлиент.ДобавитьФайл(Неопределено, Объект.Ссылка, 
		ЭтаФорма, РежимСоздания, Истина, Истина,,,,,
		Неопределено);
	Исключение
		ПоказатьПредупреждение(, ФайловыеФункцииСлужебныйКлиентСервер.ОшибкаСозданияНовогоФайла(
		ИнформацияОбОшибке()));
	КонецПопытки;

		
КонецПроцедуры

&НаКлиенте
Процедура ФайлыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ОткрытьФайлВыполнить();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФайл(Файл)
	
	Если Не ЗначениеЗаполнено(Файл) Тогда 
		Возврат;
	КонецЕсли;
	
	ДанныеФайла = РаботаСФайламиВызовСервера.ДанныеФайлаДляОткрытия(
		Файл, 
		Неопределено, 
		ЭтаФорма.УникальныйИдентификатор, 
		Неопределено, 
		ПредыдущийАдресФайла);
		
	КомандыРаботыСФайламиКлиент.Открыть(ДанныеФайла);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФайлВыполнить()
   	
	ТекущиеДанные = ТекущиеДанныеСпискаФайлов();
	Если ТекущиеДанные = Неопределено Тогда 
		Возврат;
	КонецЕсли;	
	
	ОткрытьФайл(ТекущиеДанные.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Функция ТекущиеДанныеСпискаФайлов()
	
	ТекущиеДанные = Элементы.Файлы.ТекущиеДанные;
	
	Возврат ТекущиеДанные;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область ОбработчикиКомандФормы_Отправить
&НаКлиенте
Процедура ПроцессИсполнение(Команда)
	РаботаСБизнесПроцессамиКлиент.ОткрытьПомощникСозданияОсновныхПроцессов(
		"Исполнение", Объект.Ссылка, ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ПроцессОзнакомление(Команда)
	РаботаСБизнесПроцессамиКлиент.ОткрытьПомощникСозданияОсновныхПроцессов(
		"Ознакомление", Объект.Ссылка, ЭтаФорма);
КонецПроцедуры

#КонецОбласти
