
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// параметры
	НачалоПериода = НачалоМесяца(ТекущаяДата());
	КонецПериода  = КонецМесяца(НачалоПериода);
	Пользователь  = ПользователиКлиентСервер.ТекущийПользователь();	
	
		
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// установить отбор
	УстановитьОтборНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
Процедура НачалоПриИзменении(Элемент)
	
	УстановитьОтборНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
Процедура КонецПериодаПриИзменении(Элемент)
	
	УстановитьОтборНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
Процедура ПользовательПриИзменении(Элемент)
	
	УстановитьОтборНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
Процедура ПользовательОчистка(Элемент, СтандартнаяОбработка)
	
	УстановитьОтборНаКлиенте();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УстановитьОтборНаКлиенте()
	
	// дата начала
	ОтборВидСравнения = ВидСравненияКомпоновкиДанных.БольшеИлиРавно;
	УстановитьОтбор("Дата",НачалоПериода,ОтборВидСравнения);
	
	// дата окончания
	Если ЗначениеЗаполнено(КонецПериода) Тогда
		ОтборВидСравнения = ВидСравненияКомпоновкиДанных.МеньшеИлиРавно;
		УстановитьОтбор("КонецПериода",КонецДня(КонецПериода),ОтборВидСравнения);	
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(Пользователь) Тогда
		УстановитьОтбор("Сотрудник",Пользователь,ВидСравненияКомпоновкиДанных.Равно);
	Иначе
	   	ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбораДинамическогоСписка(Список, "Сотрудник");
	КонецЕсли; 
	
КонецПроцедуры
		
&НаСервере
Процедура УстановитьОтбор(ИмяПоля,ПравоеЗначение,ВидСравнения)
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		Список, ИмяПоля, ПравоеЗначение,
			ВидСравнения, , Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтключитьОтбор(Команда)
	
	ПустаяДата    = Дата(1, 1, 1, 0, 0, 0);
	
	НачалоПериода = ПустаяДата;
	КонецПериода  = ПустаяДата;
	
	Пользователь = ПредопределенноеЗначение("Справочник.Пользователи.ПустаяСсылка");
	
	ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбораДинамическогоСписка(Список, "Дата");
	ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбораДинамическогоСписка(Список, "Сотрудник");
	
КонецПроцедуры

#КонецОбласти
