
////////////////////////////////////////////////////////////////////////////////
// Обработчики событий формы
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Отбор") Тогда
		Если НЕ ЗначениеЗаполнено(Параметры.Отбор.Наименование) Тогда
			Элементы.Декорация.Заголовок = "Создание ПИН-кода";
		Иначе
		    Элементы.ДекорацияПинКод.Видимость = Ложь;
			Элементы.Подтверждение.Видимость   = Ложь;
		КонецЕсли; 
		
		КонтрольныеДанные = Параметры.Отбор.Наименование;
		Подтверждение     = Параметры.Отбор.Наименование;	
		
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура Завершить(Команда)
	
	Если СтрДлина(Данные) <> 5 Тогда
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Указали неправильный пароль, пароль должен состоять из 4-х символов'"),
		Данные);
		
		СообщитьПользователюОбОшибке(ТекстСообщения);
	Иначе
		Если Данные <> Подтверждение Тогда
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Введенный код не верен'"),
			Данные);
			
			СообщитьПользователюОбОшибке(ТекстСообщения);
		Иначе
			ЭтаФорма.Закрыть(Данные);	
		КонецЕсли; 
	КонецЕсли; 
	
	
КонецПроцедуры

&НаКлиенте
Процедура СообщитьПользователюОбОшибке(ТекстСообщения)
	Отказ = Ложь;
		
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
	ТекстСообщения,
	,
	"Данные",,
	
	Отказ);

КонецПроцедуры

#КонецОбласти

