
#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	Отказ = Ложь;
	Уровень = 0;
	Если ЭтотОбъект.ДатаНачала.Дата > ЭтотОбъект.ДатаОкончания.Дата Тогда
		ТекстСообщения = НСтр("ru = 'Дата начала периода не может быть больше даты конца периода'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,,, Отказ);
	КонецЕсли;
	
	Если Не Отказ Тогда 
		
		Попытка
			
			ДокументРезультат.Очистить();
			
			СхемаКомпоновкиДанных = ЭтотОбъект.ПолучитьМакет("ОтчетФРД");
			
			Настройки = ЭтотОбъект.КомпоновщикНастроек.ПолучитьНастройки();
			////________________________________________________________________________________________________________________________
			СхемаКомпоновкиДанных.Параметры.ДатаНачала.Значение	   = ЭтотОбъект.ДатаНачала.Дата;
			СхемаКомпоновкиДанных.Параметры.ДатаОкончания.Значение = КонецДня(ЭтотОбъект.ДатаОкончания.Дата);
			
			
			Для Каждого ТекПараметр Из Настройки.ПараметрыДанных.Элементы Цикл
				
				Если ТипЗнч(ТекПараметр) = Тип("ЗначениеПараметраНастроекКомпоновкиДанных") Тогда
					Если ТекПараметр.Параметр = (Новый ПараметрКомпоновкиДанных("ДатаНачала")) Тогда
						ТекПараметр.Значение = ЭтотОбъект.ДатаНачала.Дата;
						ТекПараметр.Использование = Истина;
					КонецЕсли;
					Если ТекПараметр.Параметр = (Новый ПараметрКомпоновкиДанных("ДатаОкончания")) Тогда
						ТекПараметр.Значение = КонецДня(ЭтотОбъект.ДатаОкончания.Дата);
						ТекПараметр.Использование = Истина;
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЦикла;
			
			КомпоновщикМакета         = Новый КомпоновщикМакетаКомпоновкиДанных;
			Настройки.ПараметрыВывода.Элементы.Найти("Title").Значение = "Отчет по ФРД с " + НРег(Формат(ЭтотОбъект.ДатаНачала.Дата,"ДФ=dd.MM.yyyy"))
			+ " по " + НРег(Формат(ЭтотОбъект.ДатаОкончания.Дата,"ДФ=dd.MM.yyyy"));
	        МакетКомпоновки           = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, ДанныеРасшифровки);
			ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
			ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки,, ДанныеРасшифровки);

			ПроцессорВывода           = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
			ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
			ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
			ДокументРезультат.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
			ДокументРезультат.АвтоМасштаб = Истина;
			ДокументРезультат.ПоказатьУровеньГруппировокСтрок(Уровень);   //Уровень 1
			
			ДокументРезультат.ВерхнийКолонтитул.ТекстСправа = "отчет сформирован: " + ТекущаяДата();
			ДокументРезультат.ВерхнийКолонтитул.Выводить    = Истина;
			
		Исключение
			ДокументРезультат = Новый ТабличныйДокумент;
			
			ТекстСообщения = "Возникли ошибки при построении отчета." + Символы.ПС + ОписаниеОшибки();
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,,, Отказ);
			
		
		КонецПопытки;
		
		Если ДокументРезультат.Рисунки.Количество() > 0 Тогда
			
			ДокументРезультат.Рисунки[0].Ширина = 350;
			
		КонецЕсли; 
		
		  	
	КонецЕсли;
	
КонецПроцедуры

Функция СформироватьТЗ(Вариант) Экспорт
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	
	СхемаКомпоновкиДанных = ЭтотОбъект.ПолучитьМакет("ОтчетФРД");
	УникальныйИдентификатор = Новый УникальныйИдентификатор;
	КомпоновщикНастроекОтбора = Новый КомпоновщикНастроекКомпоновкиДанных;
	АдресСхемыКомпоновкиДанных = ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, УникальныйИдентификатор);
	КомпоновщикНастроекОтбора.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСхемыКомпоновкиДанных));
	КомпоновщикНастроекОтбора.ЗагрузитьНастройки(СхемаКомпоновкиДанных.ВариантыНастроек[Вариант].Настройки);	
	Макет = КомпоновщикМакета.Выполнить(ПолучитьИзВременногоХранилища(АдресСхемыКомпоновкиДанных),
	КомпоновщикНастроекОтбора.ПолучитьНастройки(), , ,
	Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	
	//________________________________________________________________________________________________________________________
	Для Каждого ТекПараметр Из Макет.ЗначенияПараметров Цикл
		
		Если ТипЗнч(ТекПараметр) = Тип("ЗначениеПараметраМакетаКомпоновкиДанных") Тогда
			Если ТекПараметр.Имя = "ДатаНачала" Тогда
				ТекПараметр.Значение = ЭтотОбъект.ДатаНачала.Дата;
			КонецЕсли;
			Если ТекПараметр.Имя = "ДатаОкончания" Тогда
				ТекПараметр.Значение = КонецДня(ЭтотОбъект.ДатаОкончания.Дата);
			КонецЕсли;
						
		КонецЕсли;
		
	КонецЦикла;

	//________________________________________________________________________________________________________________________
	Настройки = ЭтотОбъект.КомпоновщикНастроек.ПолучитьНастройки();	
	
	
	Для Каждого ТекПараметр Из Настройки.ПараметрыДанных.Элементы Цикл
		
		Если ТипЗнч(ТекПараметр) = Тип("ЗначениеПараметраНастроекКомпоновкиДанных") Тогда
			Если ТекПараметр.Параметр = (Новый ПараметрКомпоновкиДанных("ДатаНачала")) Тогда
				ТекПараметр.Значение = ЭтотОбъект.ДатаНачала.Дата;
				ТекПараметр.Использование = Истина;
			КонецЕсли;
			Если ТекПараметр.Параметр = (Новый ПараметрКомпоновкиДанных("ДатаОкончания")) Тогда
				ТекПараметр.Значение = КонецДня(ЭтотОбъект.ДатаОкончания.Дата);
				ТекПараметр.Использование = Истина;
			КонецЕсли;
			
		КонецЕсли;
	КонецЦикла;

	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(Макет, , , Истина);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	
	ТабУслуг = Новый ТаблицаЗначений;	
	ПроцессорВывода.УстановитьОбъект(ТабУслуг);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
	Возврат ТабУслуг;


КонецФункции

#КонецОбласти

