
#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриОткрытииНаСервере()
	
	 ОбновитьДанныеФормы();
		
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПриОткрытииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппаСтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	Элементы.СписокВыполненныеЗаявки.Обновить();
	Элементы.Список.Обновить();
	ОбновитьДанныеФормы();  
КонецПроцедуры

&НаКлиенте
Процедура КнопкаМоиЗаявки(Команда)
	
	Если Элементы.КнопкаМоиЗаявки.Заголовок = "" Тогда
		мЗаголовок = "1";
		Картинка  = БиблиотекаКартинок.ОтключитьОтбор;
		ТекущийПользователь = ПользователиКлиентСервер.ТекущийПользователь();
		
		УстановитьОтборСписка("Исполнитель",ТекущийПользователь)
		
	Иначе
		УдалитьОтборСписка(Список, "Исполнитель");
		мЗаголовок = ""; 
		Картинка  = БиблиотекаКартинок.ОтборКомпоновкиДанных;
	КонецЕсли; 
	
	Элементы.КнопкаМоиЗаявки.Заголовок = мЗаголовок;
	Элементы.КнопкаМоиЗаявки.Картинка  = Картинка;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборСписка(ИмяПоля,ПравоеЗначение)
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор,
		ИмяПоля,
		ПравоеЗначение,
		ВидСравненияКомпоновкиДанных.Равно);
		
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УдалитьОтборСписка(Список, ИмяОтбора)
	ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбора(Список.Отбор, ИмяОтбора);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура ОбновитьДанныеФормы()
	 	                                   
	 Структура = Документы.ТБС_ЗаявкиIT.СформироватьДанныеПоЗаявкам();
	 ЗаполнитьЗначенияСвойств(ЭтотОбъект,Структура);
	 
	 ОбновитьРейтинг();
	 
	 
КонецПроцедуры

&НаСервере
Процедура ОбновитьРейтинг()
	
	ОтчетРейтинг.Очистить();
	
	РезультатЗапроса = ТБС_ОбщегоНазначения.СформироватьБаллыПоИсполнителям(ТекущаяДата());
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
			
	КонецЦикла; 
	
	
КонецПроцедуры

#КонецОбласти