
&НаКлиенте
Процедура ВыборПериода(Команда)
	
	ПроизвольныйПериод               = Новый СтандартныйПериод;
	ПроизвольныйПериод.Вариант       = ВариантСтандартногоПериода.ПроизвольныйПериод;
	ПроизвольныйПериод.ДатаНачала    = Отчет.ДатаНачала.Дата;
	ПроизвольныйПериод.ДатаОкончания = Отчет.ДатаОкончания.Дата;
	
	ДиалогВыбораПериода        = Новый ДиалогРедактированияСтандартногоПериода();
	ДиалогВыбораПериода.Период = ПроизвольныйПериод;
	
	ДиалогВыбораПериода.Показать(Новый ОписаниеОповещения("ВыборПериодаЗавершение", ЭтотОбъект));
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборПериодаЗавершение(Период, ДополнительныеПараметры) Экспорт
	
	Если Не Период = Неопределено Тогда
		Отчет.ДатаНачала.Дата    = Период.ДатаНачала;
		Отчет.ДатаОкончания.Дата = Период.ДатаОкончания;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
		Отчет.ДатаНачала.Вариант    = ВариантСтандартнойДатыНачала.ПроизвольнаяДата;
		Отчет.ДатаОкончания.Вариант = ВариантСтандартнойДатыНачала.ПроизвольнаяДата;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Отчет.ДатаНачала.Дата    = НачалоМесяца(ТекущаяДата());
	Отчет.ДатаОкончания.Дата = КонецМесяца(Отчет.ДатаНачала.Дата); 
	УстановитьВидимость();
	  
КонецПроцедуры

Функция УстановитьВидимость()
		
КонецФункции

&НаСервере
Процедура СформироватьОтчетНаСервере(Вариант)
	
	// Преобразует реквизит Объект в прикладной объект.
	Документ = РеквизитФормыВЗначение("Отчет");
	
	// Выполняет пересчет методом, определенным в модуле документа.
	Таблица = Документ.СформироватьТЗ(Вариант);
	ЗначениеВРеквизитФормы(Документ, "Отчет");
	
КонецПроцедуры
